RAKWireless/RAK-STM32-RUI/boards.txt
# Debug Menu
WisDuoRAK3172EvaluationBoard.menu.debug.l0=Level 0 (Release)
WisDuoRAK3172EvaluationBoard.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
WisDuoRAK3172EvaluationBoard.menu.debug.l1=Level 1 (Error Message)
WisDuoRAK3172EvaluationBoard.debug.l1.build.debug_flags=-DCFG_DEBUG=1
WisDuoRAK3172EvaluationBoard.menu.debug.l2=Level 2 (Full Debug)
WisDuoRAK3172EvaluationBoard.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
WisDuoRAK3172EvaluationBoard.menu.debug.l3=Level 3 (Segger SystemView)
WisDuoRAK3172EvaluationBoard.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
WisDuoRAK3172EvaluationBoard.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# WisDuo RAK3272-SiP Board
# ----------------------------------
WisDuoRAK3272SiPBoard.name=WisDuo RAK3272-SiP Board
WisDuoRAK3272SiPBoard.bootloader.tool=bootburn
WisDuoRAK3272SiPBoard.build.variant_h=variant_{build.board}.h
WisDuoRAK3272SiPBoard.build.series=rak3172-sip

# Upload
WisDuoRAK3272SiPBoard.upload.tool=uploader_ymodem
WisDuoRAK3272SiPBoard.upload.protocol=uploader_ymodem
WisDuoRAK3272SiPBoard.upload.use_1200bps_touch=true
WisDuoRAK3272SiPBoard.upload.wait_for_upload_port=true
WisDuoRAK3272SiPBoard.upload.maximum_size=200704
WisDuoRAK3272SiPBoard.upload.maximum_data_size=48640

# Build
WisDuoRAK3272SiPBoard.build.mcu=cortex-m4
WisDuoRAK3272SiPBoard.build.f_cpu=64000000
WisDuoRAK3272SiPBoard.build.board=WisDuo_RAK3272-SiP_Board
WisDuoRAK3272SiPBoard.build.core=STM32WLE
WisDuoRAK3272SiPBoard.build.variant=WisDuo_RAK3272-SiP_Board
WisDuoRAK3272SiPBoard.build.usb_manufacturer="RAKwireless"
WisDuoRAK3272SiPBoard.build.usb_product="WisDuo RAK3272-SiP Board"
WisDuoRAK3272SiPBoard.build.extra_flags=-DSTM32WLE5xx -DRAK3272_SIP_VA -Drak3172_sip {build.flags.usb}
WisDuoRAK3272SiPBoard.build.flags.feature= -DSUPPORT_LORA -DLORA_RF_LP -DLORA_IO_SPI_PORT=2 -DSYS_RTC_COUNTER_PORT=2 -DATCMD_CUST_TABLE_SIZE=64 -DWAN_TYPE=0 -DLORA_STACK_VER=0x040407  -Drak3172_sip -DCORE_CM4 -DUSE_HAL_DRIVER -DSTM32WLE5xx -DREGION_AS923 -DREGION_AU915 -DREGION_CN470 -DREGION_CN779 -DREGION_EU433 -DREGION_EU868 -DREGION_KR920 -DREGION_IN865 -DREGION_US915 -DREGION_RU864 -DSOFT_SE -DSECURE_ELEMENT_PRE_PROVISIONED -DLORAMAC_CLASSB_ENABLED -DSUPPORT_SPI -DRUI_SDK
WisDuoRAK3272SiPBoard.build.flags.lib_path="-L{runtime.platform.path}/cores/STM32WLE/app" "-L{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx" "-L{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal" "-L{runtime.platform.path}/cores/STM32WLE/external" "-L{runtime.platform.path}/cores/STM32WLE/component/core/board/{build.series}" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/serial" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/flash" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/timer" "-L{runtime.platform.path}/cores/STM32WLE/component/service/nvm" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/system" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/powersave" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/wdt" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/gpio" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/twimst" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/delay" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/rtc" "-L{runtime.platform.path}/cores/STM32WLE/component/service/lora" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/delay" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/gpio" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/rtc" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/twimst" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/dfu" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/pwm" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/adc" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/spimst" "-L{runtime.platform.path}/cores/STM32WLE/component/service/battery" "-L{runtime.platform.path}/cores/STM32WLE/component/service/mode" "-L{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api" "-L{runtime.platform.path}/cores/STM32WLE/component/fund/event_queue" "-L{runtime.platform.path}/cores/STM32WLE/component/fund/circular_queue" "-L{runtime.platform.path}/variants/{build.variant}" "-L{runtime.platform.path}/system/{build.variant}"
WisDuoRAK3272SiPBoard.build.flags.inc_path="-I{runtime.platform.path}/variants/{build.variant}" "-I{runtime.platform.path}/system/{build.variant}" "-I{runtime.platform.path}/cores/STM32WLE/app/RAK3272-SiP/src" "-I{runtime.platform.path}/cores/STM32WLE/component/inc" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/none/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/board/{build.series}" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/timer" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/delay" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/spimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/powersave" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/gpio" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/rtc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/twimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/dfu" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/pwm" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/adc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/system" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/ble" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/flash" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/wdt" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/nfc" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora/packages" "-I{runtime.platform.path}/cores/STM32WLE/component/service/nvm" "-I{runtime.platform.path}/cores/STM32WLE/component/service/battery" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/cli" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/transparent" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/protocol" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api/avr" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/event_queue" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/circular_queue" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/system" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/apps/LoRaMac/common/LmHandler" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Device/ST/STM32WLxx/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/STM32WLxx_HAL_Driver/Inc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy/stm32_radio_driver" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/timer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/lpm/tiny_lpm" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/misc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/sequencer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/trace/adv_trace" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals/" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/queue" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/scheduler" "-I{runtime.platform.path}/cores/STM32WLE/external/FatFs/source" "-I{runtime.platform.path}/cores/STM32WLE/external/spiffs/src"
WisDuoRAK3272SiPBoard.build.flags.lib=-lboot -luhal -ludrv_serial -ludrv_flash -ludrv_timer -ludrv_system -ludrv_powersave -ludrv_wdt -ludrv_gpio -ludrv_twimst -ludrv_delay -ludrv_rtc -ludrv_delay -ludrv_gpio -ludrv_rtc -ludrv_twimst -ludrv_dfu -ludrv_pwm -ludrv_adc -ludrv_spimst -lrui_v3_api
WisDuoRAK3272SiPBoard.build.flags.inc_path="-I{runtime.platform.path}/variants/{build.variant}" "-I{runtime.platform.path}/system/{build.variant}" "-I{runtime.platform.path}/cores/STM32WLE/app/RAK3272-SiP/src" "-I{runtime.platform.path}/cores/STM32WLE/component/inc" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/none/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/board/{build.series}" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/timer" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/delay" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/spimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/powersave" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/gpio" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/rtc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/twimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/dfu" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/pwm" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/adc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/system" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/ble" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/flash" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/wdt" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/nfc" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora/packages" "-I{runtime.platform.path}/cores/STM32WLE/component/service/nvm" "-I{runtime.platform.path}/cores/STM32WLE/component/service/battery" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/cli" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/transparent" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/protocol" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api/avr" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/event_queue" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/circular_queue" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/system" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/apps/LoRaMac/common/LmHandler" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Device/ST/STM32WLxx/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/STM32WLxx_HAL_Driver/Inc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy/stm32_radio_driver" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/timer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/lpm/tiny_lpm" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/misc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/sequencer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/trace/adv_trace" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals/" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/queue" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/scheduler" "-I{runtime.platform.path}/cores/STM32WLE/external/FatFs/source" "-I{runtime.platform.path}/cores/STM32WLE/external/spiffs/src"
WisDuoRAK3272SiPBoard.build.ldscript=flash_stm32wle5xx.ld
WisDuoRAK3272SiPBoard.build.vid=0x1A86
WisDuoRAK3272SiPBoard.build.pid=0x7523

